package lotto.controller;

public class LottoController {
    public void run() {
        // * 사용자가 구입 금액을 입력한다.

        // * 입력받은 구입 금액을 저장한다.
        // * 거스름돈은 제거한다.

        // * 구입 금액을 가지고 1000 원짜리 로또를 구매할 수 있는 만큼 구매한다.

        // * 로또 한 장에는 6 개의 무작위 숫자가 있다.

        // * 사용자가 당첨 번호 6 개를 입력한다.

        // * 로또 각 장과 당첨 번호를 비교해서 3 개 일치, 4 개 일치, 5 개 일치, 6 개 일치하는 개수를 저장한다.
        // * 번호 일치 개수를 확인하면서 최종 당첨금 총 합을 구한다.

        // * [사용자의 초기 구입 금액에서 거스름돈을 뺀 금액] 을 [최종 당첨금 총 합] 으로 나누어서 총 수익률을 구한다.

    }
}
